class EquipmentConstants {

    /**
     * ------------------------------------------------------------------------
     * 禁止在商店出售的特殊装备列表，不显示卖出按钮。
     * ------------------------------------------------------------------------
     */
    static PROHIBIT_SELLING_ITEM_LIST = [
        "千与千寻",
        "勿忘我",
        "神枪 永恒",
        "霸邪斧 天煌",
        "魔刀 哭杀",
        "神器 苍穹",
        "魔神器 幻空",
        "真·圣剑 苍白的正义",
        "双经斩",
        "千幻碧水猿洛克奇斯",
        "地纹玄甲龟斯特奥特斯",
        "幽冥黑鳞蟒罗尼科斯",
        "火睛混沌兽哈贝达",
        "羽翅圣光虎阿基勒斯",
        "金翅追日鹰庞塔雷斯",
        "风翼三足凤纳托利斯",
        "圣皇铠甲 天威",
        "薄翼甲",
        "魔盔 虚无",
        "神冠 灵通",
        "龙",
        "玉佩",
        "宠物蛋"
    ];

    /**
     * ------------------------------------------------------------------------
     * 经验无关的装备，以下装备不考虑其经验属性。
     * ------------------------------------------------------------------------
     */
    static NO_EXPERIENCE_ITEM_LIST = [
        "大师球",
        "宗师球",
        "超力怪兽球",
        "宠物蛋"
    ];

}

export = EquipmentConstants;